Documents/ПриобретениеТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПриобретениеТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриобретениеТоваровИУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

 &НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	НоменклатураДокумента = Новый Массив;
	НоменклатураДокумента.Добавить(СтрокаТоваров.Номенклатура);
	
	ТипыНоменклатуры = ПолучитьТипыНоменклатуры(НоменклатураДокумента);
	СтрокаТоваров.ТипНоменклатуры = ТипыНоменклатуры[СтрокаТоваров.Номенклатура];
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	НоменклатураДокумента = ПолучитьНоменклатуруДокумента();
	ТипыНоменклатуры = ПолучитьТипыНоменклатуры(НоменклатураДокумента);
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		СтрокаТоваров.ТипНоменклатуры = ТипыНоменклатуры[СтрокаТоваров.Номенклатура];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОбщегоНазначенияКлиентСервер.ДобавитьПростойЭлементУсловногоОформления(ЭтаФорма,
		"ТоварыСклад", "ОтметкаНезаполненного", Ложь, 
		"Объект.Товары.ТипНоменклатуры", ВидСравненияКомпоновкиДанных.Равно, Перечисления.ТипыНоменклатуры.Услуга);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруДокумента()
	
	ВозвращаемоеЗначение = Новый Массив;
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		ВозвращаемоеЗначение.Добавить(СтрокаТоваров.Номенклатура);
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьТипыНоменклатуры(МассивНоменклатуры)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНоменклатуры, "Тип");
КонецФункции

&НаСервереБезКонтекста
Функция ПодразделениеСклада(Склад)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Подразделение");
КонецФункции

#КонецОбласти
